"espk" = "Apple-port för högtalare";
"ispk" = "Inbyggd";
"emic" = "Port för mikrofon";
"imic" = "Inbyggd";
"hdpn" = "Hörlursuttag";
"lini" = "Ljudport linje in";
"lino" = "Ljudport linje ut";
"spdi" = "Optisk digital inport";
"spdo" = "Optiskt digital utport";
"pci " = "PCI-kort";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Nätverksenhet";
"blue" = "Bluetooth";
"bluh" = "Bluetooth-hörlurar";
"blus" = "Bluetooth-headset";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
